kershaw/constant/physicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
   =========                 |
   \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
    \\    /   O peration     | Website:  https://openfoam.org
     \\  /    A nd           | Version:  13
      \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format          ascii;
    class           dictionary;
    object          physicalProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

viscosityModel      constant;

//nu                  [0 2 -1 0 0 0 0] 0.1;     //Re = 10   
nu                  [0 2 -1 0 0 0 0] 0.01;      //Re = 100  D
//nu                  [0 2 -1 0 0 0 0] 0.001;   //Re = 1000 

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //