kershaw/system/sampleDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format          ascii;
    class           dictionary;
    location        "system";
    object          sampleDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type                sets;

libs                ("libsampling.so");

setFormat           raw;

interpolationScheme cellPointFace;    //cell, cellPoint, cellPointFace

fields
(
    U
);

sets
(
    l1
    {
        type        lineFace;   //lineFace, lineCell, lineFaceCell, lineUniform

        //nPoints   100;

        axis        x;

        start       (-1 0.5 0);

        end         (2 0.5 0);
    }

    l2
    {
        type        lineFace;

        //nPoints   100;

        axis        y;

        start       (0.5 -1 0);

        end         (0.5 2 0);
    }
);

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //